Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ОстаткиТоваров.Записывать = Истина;
    
    Для Каждого Строка Из СписокТоваров Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Склад = СкладОткуда;
        Движение.Товар = Строка.Товар;
        Движение.Количество = Строка.Количество;
        
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Склад = СкладКуда;
        Движение.Товар = Строка.Товар;
        Движение.Количество = Строка.Количество;
    КонецЦикла;
КонецПроцедуры